In [2]:
# basic imports
import numpy as np
import pandas as pd
import datetime as dt
import seaborn as sns
import matplotlib.pyplot as plt

%matplotlib inline

In [3]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [4]:
path = "/content/drive/MyDrive/xeno_data_set.csv"
data_frame = pd.read_csv(path, parse_dates=['created_on'])
data_frame.head()

         id  customer_id  location_id  ... amount       bill_no          created_on
0  42877344           60          192  ...   1039  GGN001-24323 2018-06-24 00:00:00
1  35625005          134          535  ...   1029   DEL007-1522 2018-01-14 19:21:00
2  44397299          166          347  ...    355  DEL005-29173 2018-09-13 13:40:00
3  44405460          166          347  ...    371  DEL005-29180 2018-09-13 14:33:00
4  44717004          166          347  ...    371  DEL005-29603 2018-09-16 12:40:00

[5 rows x 7 columns]

In [5]:
print("Dataframe Information & Descriptive Statistics \n")
data_frame.info()
data_frame.describe()

Dataframe Information & Descriptive Statistics

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 533327 entries, 0 to 533326
Data columns (total 7 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   id           533327 non-null  int64
 1   customer_id  533327 non-null  int64
 2   location_id  533327 non-null  int64
 3   channel      533327 non-null  object
 4   amount       533327 non-null  int64
 5   bill_no      533327 non-null  object
 6   created_on   533327 non-null  datetime64[ns]
dtypes: datetime64[ns](1), int64(4), object(2)
memory usage: 28.5+ MB

                 id   customer_id    location_id         amount
count  5.333270e+05  5.333270e+05  533327.000000  533327.000000
mean   4.794955e+07  4.832702e+06    1500.813602     551.399865
std    7.987404e+06  3.424067e+06    1914.140397    1388.179206
min    3.561932e+07  6.000000e+01     192.000000       0.000000
25%    4.170082e+07  1.681087e+06     194.000000     304.000000
50%    4.692534e+07  5.880546e+06     272.000000     372.000000
75%    5.031443e+07  7.501177e+06    4003.000000     584.000000
max    6.392059e+07  1.165519e+07    5099.000000  604827.000000

In [6]:
data_frame['created_on'].min()

Timestamp('2018-01-01 00:00:00')

In [7]:
data_frame['created_on'].max()

Timestamp('2019-12-03 22:46:00')

In [8]:
data_frame['month_year'] = data_frame['created_on'].apply(lambda x: x.strftime('%Y-%m')) #creating new month_year column

In [9]:
# this table will give overall revenue by month
overall_revenue_df = data_frame.groupby('month_year').sum()['amount'].reset_index()
print(overall_revenue_df)

   month_year    amount
0     2018-01  17210945
1     2018-02  16681065
2     2018-03  15052840
3     2018-04  15582275
4     2018-05  16251829
5     2018-06  18717523
6     2018-07  19673116
7     2018-08  16533437
8     2018-09  18418843
9     2018-10  21382952
10    2018-11  25534650
11    2018-12  21780372
12    2019-01  14473684
13    2019-02  14248603
14    2019-03  19977149
15    2019-04   2367858
16    2019-05   2946789
17    2019-06   2663481
18    2019-07   2428741
19    2019-08   2945919
20    2019-09   2815535
21    2019-10   2678773
22    2019-11   1875251
23    2019-12   1834806

In [10]:
# this table will give total month on month revenue for each location_id
location_revenue_df = data_frame.groupby(['location_id','month_year']).sum()['amount'].reset_index()
print(location_revenue_df)

     location_id month_year   amount
0            192    2018-01  1517518
1            192    2018-02  1406935
2            192    2018-03  1272744
3            192    2018-04  1544696
4            192    2018-05  1685342
..           ...        ...      ...
704         5099    2019-06    15469
705         5099    2019-07    22061
706         5099    2019-08     3758
707         5099    2019-09     5492
708         5099    2019-10    10415

[709 rows x 3 columns]

In [11]:
# this table will give overall orders by month
overall_orders_df = data_frame.groupby('month_year')['id'].count()
print(overall_orders_df)

month_year
2018-01    28850
2018-02    27427
2018-03    25520
2018-04    27060
2018-05    27909
2018-06    32088
2018-07    33458
2018-08    28318
2018-09    37358
2018-10    36025
2018-11    43802
2018-12    35261
2019-01    25607
2019-02    30756
2019-03    46083
2019-04     4969
2019-05     6159
2019-06     5700
2019-07     5472
2019-08     5990
2019-09     5899
2019-10     6072
2019-11     3731
2019-12     3813
Name: id, dtype: int64

In [12]:
# this table will give total month on month orders for each location_id
location_orders_df = data_frame.groupby(['location_id','month_year']).count()['id'].reset_index()
print(location_orders_df)

     location_id month_year    id
0            192    2018-01  2497
1            192    2018-02  2403
2            192    2018-03  2156
3            192    2018-04  3139
4            192    2018-05  3418
..           ...        ...   ...
704         5099    2019-06     1
705         5099    2019-07     1
706         5099    2019-08     1
707         5099    2019-09     1
708         5099    2019-10     1

[709 rows x 3 columns]

In [13]:
# this table will give count of overall customers by month
overall_customers_df = data_frame.groupby('month_year').count()['customer_id'].reset_index()
print(overall_customers_df)

   month_year  customer_id
0     2018-01        28850
1     2018-02        27427
2     2018-03        25520
3     2018-04        27060
4     2018-05        27909
5     2018-06        32088
6     2018-07        33458
7     2018-08        28318
8     2018-09        37358
9     2018-10        36025
10    2018-11        43802
11    2018-12        35261
12    2019-01        25607
13    2019-02        30756
14    2019-03        46083
15    2019-04         4969
16    2019-05         6159
17    2019-06         5700
18    2019-07         5472
19    2019-08         5990
20    2019-09         5899
21    2019-10         6072
22    2019-11         3731
23    2019-12         3813

In [14]:
# this table will give total count of month on month customers for each location_id
location_customers_df = data_frame.groupby(['location_id','month_year']).count()['customer_id'].reset_index()
print(location_customers_df)

     location_id month_year  customer_id
0            192    2018-01         2497
1            192    2018-02         2403
2            192    2018-03         2156
3            192    2018-04         3139
4            192    2018-05         3418
..           ...        ...          ...
704         5099    2019-06            1
705         5099    2019-07            1
706         5099    2019-08            1
707         5099    2019-09            1
708         5099    2019-10            1

[709 rows x 3 columns]

In [15]:
repeat_customers_df = data_frame.drop_duplicates(subset = ['customer_id'], keep = 'first')
repeat_customers_df.head()

          id  customer_id  ...          created_on month_year
0   42877344           60  ... 2018-06-24 00:00:00    2018-06
1   35625005          134  ... 2018-01-14 19:21:00    2018-01
2   44397299          166  ... 2018-09-13 13:40:00    2018-09
7   36018577          180  ... 2018-01-17 13:40:00    2018-01
14  43892343          199  ... 2018-08-15 19:39:00    2018-08

[5 rows x 8 columns]

In [16]:
# this table will give overall count of repeat customers by month
repeat_customers = repeat_customers_df.groupby(['month_year']).count()['customer_id'].reset_index()
print(repeat_customers)

   month_year  customer_id
0     2018-01        17095
1     2018-02        14644
2     2018-03        12072
3     2018-04        12782
4     2018-05        13145
5     2018-06        16069
6     2018-07        16850
7     2018-08        13454
8     2018-09        18702
9     2018-10        17452
10    2018-11        20470
11    2018-12        15614
12    2019-01        10670
13    2019-02        13322
14    2019-03        19979
15    2019-04         2055
16    2019-05         2489
17    2019-06         2322
18    2019-07         2370
19    2019-08         2376
20    2019-09         2507
21    2019-10         2490
22    2019-11         1527
23    2019-12         1542

In [17]:
# this table will give overall count of repeat customers by location_id and month
repeat_customers_location = repeat_customers_df.groupby(['location_id','month_year']).count()['customer_id'].reset_index()
print(repeat_customers_location)

     location_id month_year  customer_id
0            192    2018-01         1449
1            192    2018-02         1271
2            192    2018-03         1072
3            192    2018-04         1662
4            192    2018-05         1562
..           ...        ...          ...
658         5099    2018-03            1
659         5099    2018-07            1
660         5099    2018-09            1
661         5099    2018-10            4
662         5099    2018-11            3

[663 rows x 3 columns]

In [18]:
# this table will give overall count of new customers by month
new_customers = data_frame.groupby('month_year').count()['customer_id'] - repeat_customers_df.groupby('month_year').count()['customer_id']
new_customers

month_year
2018-01    11755
2018-02    12783
2018-03    13448
2018-04    14278
2018-05    14764
2018-06    16019
2018-07    16608
2018-08    14864
2018-09    18656
2018-10    18573
2018-11    23332
2018-12    19647
2019-01    14937
2019-02    17434
2019-03    26104
2019-04     2914
2019-05     3670
2019-06     3378
2019-07     3102
2019-08     3614
2019-09     3392
2019-10     3582
2019-11     2204
2019-12     2271
Name: customer_id, dtype: int64

In [19]:
# this table will give overall count of new customers by location_id and month
new_customers_location = data_frame.groupby(['location_id','month_year']).count()['customer_id'] - repeat_customers_df.groupby(['location_id','month_year']).count()['customer_id']
new_customers_location

location_id  month_year
192          2018-01       1048.0
             2018-02       1132.0
             2018-03       1084.0
             2018-04       1477.0
             2018-05       1856.0
                            ...
5099         2019-06          NaN
             2019-07          NaN
             2019-08          NaN
             2019-09          NaN
             2019-10          NaN
Name: customer_id, Length: 709, dtype: float64

In [20]:
unique_customer_count = data_frame.groupby('month_year')['customer_id'].value_counts()
unique_customer_count

month_year  customer_id
2018-01     6127480        106
            6127477        103
            6127506         71
            6127597         68
            556120          45
                          ...
2019-12     11302744         1
            11302745         1
            11302746         1
            11302747         1
            11302748         1
Name: customer_id, Length: 418186, dtype: int64

In [30]:
# this table will frequency by month
frequency = data_frame.groupby('month_year')['id'].count()/data_frame.groupby('month_year')['customer_id'].value_counts()
frequency

month_year  customer_id
2018-01     6127480         272.169811
            6127477         280.097087
            6127506         406.338028
            6127597         424.264706
            556120          641.111111
                              ...
2019-12     11302744       3813.000000
            11302745       3813.000000
            11302746       3813.000000
            11302747       3813.000000
            11302748       3813.000000
Length: 418186, dtype: float64

In [31]:
# this table will frequency by location and month
frequency_location = data_frame.groupby((['location_id','month_year']))['id'].count()/data_frame.groupby((['location_id','month_year']))['customer_id'].value_counts()
frequency_location

location_id  month_year  customer_id
192          2018-01     352740         208.083333
                         474353         312.125000
                         556019         356.714286
                         353750         416.166667
                         108147         499.400000
                                           ...
5099         2019-06     7935508          1.000000
             2019-07     7935508          1.000000
             2019-08     7935508          1.000000
             2019-09     7935508          1.000000
             2019-10     7935508          1.000000
Length: 450245, dtype: float64